Торговля_11__демо/src/DataProcessors/ПодборНомеровГТДВДокументы/ПодборНомеровГТДВДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборНомеровГТДВДокументы</name>
  <attributes>
    <name>ТипНомераГТД</name>
    <type>
      <types>EnumRef.ТипыНомеровГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаВвозаНеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомерТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоРНПТ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрослеживаемыеКомплектующие</name>
    <attributes>
      <name>НомерРНПТ</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТВДокументе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияТНВЭД</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоРНПТВДокументе</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоРНПТ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Торговля_11__демо/src/Enums/ТипыНомеровГТД/ТипыНомеровГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНомеровГТД</name>
  <enumValues>
    <name>НомерГТД</name>
  </enumValues>
  <enumValues>
    <name>НомерРНПТ</name>
  </enumValues>
  <enumValues>
    <name>НомерРНПТКомплекта</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Catalogs/НомераГТД/НомераГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НомераГТД</name>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаВвозаНеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомерТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРНПТ</name>
    <comment>Это регистрационный номер партии товара, подлежащей прослеживаемости</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНомераГТД</name>
    <type>
      <types>EnumRef.ТипыНомеровГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоРНПТ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрослеживаемыеКомплектующие</name>
    <attributes>
      <name>НомерРНПТ</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияТНВЭД</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоРНПТ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Торговля_11__демо/src/DataProcessors/ПодборНомеровГТДВДокументы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Код");
	
	Если Не ЗначениеЗаполнено(Код)
		И ТипНомераГТД <> Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта Тогда
		
		ПредставлениеПоля = ?(ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерГТД,
								НСтр("ru = 'Номер таможенной декларации'"),
								НСтр("ru = 'Номер РНПТ'"));
		
		ТекстОшибки = НСтр("ru = 'Поле ""%1"" не заполнено.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПредставлениеПоля);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Код", , Отказ);
		
	КонецЕсли;
	
	ЗаполнитьНепроверяемыеРеквизитыРНПТКомплекта(НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПроверитьНаличиеДублейЭлемента(Отказ);
	ПроверитьЗаполнениеПрослеживаемыхКомплектующих(Отказ);
	ПроверитьКорректностьУказанияСтоимостей(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполненияОбъекта

Процедура ЗаполнитьНепроверяемыеРеквизитыРНПТКомплекта(НепроверяемыеРеквизиты)
	
	Если ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта
		И УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата(1, 1, 1)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НепроверяемыеРеквизиты.Добавить("ПрослеживаемыеКомплектующие");
	НепроверяемыеРеквизиты.Добавить("ПрослеживаемыеКомплектующие.Код");
	НепроверяемыеРеквизиты.Добавить("ПрослеживаемыеКомплектующие.КоличествоПоРНПТВДокументе");
	НепроверяемыеРеквизиты.Добавить("ПрослеживаемыеКомплектующие.КоличествоПоРНПТ");
	НепроверяемыеРеквизиты.Добавить("ПрослеживаемыеКомплектующие.ЕдиницаИзмеренияТНВЭД");
	
КонецПроцедуры

// Проверяет наличие дублей в информационной базе для элементов типа 'НомерРНПТ' или 'НомерГТД'.
//
// Параметры:
//	Отказ - Булево - признак продолжения выполнения обработки элемента справочника, после обработки проверки заполнения.
//					Если значение Истина, тогда выполнение обработки объекта будет прекращено.
//
Процедура ПроверитьНаличиеДублейЭлемента(Отказ)
	
	Если Отказ
		Или ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НомераГТД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НомераГТД КАК НомераГТД
	|ГДЕ
	|	НЕ НомераГТД.ПометкаУдаления
	|	И НомераГТД.Код = &Код
	|	И НомераГТД.СтранаПроисхождения = &СтранаПроисхождения
	|	И НомераГТД.ТипНомераГТД = &ТипНомераГТД";
	
	Запрос.УстановитьПараметр("ТипНомераГТД",			ТипНомераГТД);
	Запрос.УстановитьПараметр("Код",					Код);
	Запрос.УстановитьПараметр("СтранаПроисхождения",	СтранаПроисхождения);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПредставлениеТипа = ?(ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерГТД,
								НСтр("ru = 'номер ГТД'"),
								НСтр("ru = 'номер РНПТ'"));
		
		ТекстСообщения = НСтр("ru = 'Аналогичный %1 уже существует: %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																				ПредставлениеТипа,
																				Выборка.Ссылка);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПрослеживаемыхКомплектующих(Отказ)
	
	Если Отказ
		Или ТипНомераГТД <> Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПрослеживаемыеКомплектующие.Количество() = 1 Тогда
		ТекстОшибки	= НСтр("ru = 'РНПТ комплекта должен содержать информацию не менее чем о двух прослеживаемых комплектующих.
							|Дополните информацию в табличной части ""Прослеживаемые комплектующие"" или измените тип элемента справочника.'");
		Поле		= ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрослеживаемыеКомплектующие",
																		ПрослеживаемыеКомплектующие[0].НомерСтроки,
																		"НомерРНПТ");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ПрослеживаемыеКомплектующие", , Отказ);
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.НомерСтроки			КАК НомерСтроки,
	|	Комплектующие.НомерРНПТ				КАК НомерРНПТ,
	|	Комплектующие.КоличествоПоРНПТ		КАК КоличествоПоРНПТВДокументе,
	|	Комплектующие.КоличествоПоРНПТ		КАК КоличествоПоРНПТ,
	|	Комплектующие.ЕдиницаИзмеренияТНВЭД	КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ Комплектующие
	|ИЗ
	|	&Комплектующие КАК Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Комплектующие.НомерСтроки)	КАК НомерСтроки,
	|	Комплектующие.НомерРНПТ				КАК НомерРНПТ,
	|	Комплектующие.ЕдиницаИзмерения		КАК ЕдиницаИзмерения
	|ИЗ
	|	Комплектующие КАК Комплектующие
	|
	|ГДЕ
	|	Комплектующие.КоличествоПоРНПТ <> 0
	|	И Комплектующие.КоличествоПоРНПТВДокументе <> 0
	|	И Комплектующие.НомерРНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Комплектующие.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектующие.НомерРНПТ,
	|	Комплектующие.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1";
	
	Запрос.УстановитьПараметр("Комплектующие", ПрослеживаемыеКомплектующие.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ШаблонТекстаОшибки = НСтр("ru = 'Номер РНПТ ""%1"" с единицей измерения ""%2"" повторяется.'");
	
	Пока Выборка.Следующий() Цикл
		ТекстОшибки	= СтрШаблон(ШаблонТекстаОшибки,
								СокрЛП(Строка(Выборка.НомерРНПТ)),
								СокрЛП(Строка(Выборка.ЕдиницаИзмерения)));
		Поле		= ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрослеживаемыеКомплектующие",
																		Выборка.НомерСтроки,
																		"НомерРНПТ");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Поле, , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьУказанияСтоимостей(Отказ)
	
	Если Отказ
		Или ТипНомераГТД <> Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПрослеживаемыеКомплектующие.Итог("СуммаПоРНПТ") > СуммаПоРНПТ Тогда
		ТекстСообщения = НСтр("ru = 'Некорректно указаны стоимостные показатели. Стоимость компклектующих превышает стоимость комплекта.'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СуммаПоРНПТ", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
